#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//               移位操作符

//int main()
//{
//	int a = 2;
//	//把a的二进制位向左移动一位
//	int b = a << 1; 
//	
//	int c = -1;
//	// 把c的二进制位右移一位   开头是1为负数，0为正数
//	// 算术右移，左边补原符号
//	// 逻辑右移，左边补0          //  负整数二进制的三种存放形式：
//	int d = c >> 1;               // 原码：直接根据数值写出二进制序列
//                                  // 反码： 符号位不变，其他位按位取反	
//	printf("b = %d\n", b);        // 补码： 反码+1
//                                  //正整数的原反补相同
//	
//	return 0;
//}


//               &  |  ^
//      交换两个变量，不能创建第三个变量

//int main()
//{
//	int a = 3;
//	int b = 5;
//	a = a ^ b;
//	b = a ^ b;      // b= a^b^b = a^0 =a
//	a = a ^ b;      // a= a^b^b(上一步b已经等于a了)  = a^b^a
//	return 0;
//}


//        判断一个二进制数出现了几个一

//   假设一个数是 7    00000000000000000000000000000111
//        &1           00000000000000000000000000000001
//    因为1的二进制前面都是0，按位与之后前面也都变成了0
//    而最后一位是1，如果按位与的结果为1，则原数的末位就是1，反之则是0，   右移，循环

//int main()
//{
//	int a = 13;      //(8+4+1  1101)
//	int i = 0;
//	int count = 0;
//	for (i = 0; i < 32; i++)
//	{
//		int c = a & 1;
//		if (c == 1)
//		{
//			count++;
//		}
//		a = a >> 1;
//	}
//	printf("%d\n", count);
//	
//	return 0;
//}

//          将某一位改变
//   假设  13         000000000000000000000000000 0 1101    (13)
// 将空格处的0改成1  |000000000000000000000000000 1 0000   （1<<4）
//                    000000000000000000000000000 1 1101    (29)
//                                                                 000000000000000000000000000 0 1101   再变回13
//      方法一        &111111111111111111111111111 0 1111     但是这个数字很难算
//                    000000000000000000000000000 1 0000     先得到这个 （1<<4, 再~ 按位取反）

// 方法二，尝试异或   000000000000000000000000000 1 0000


int main()
{
	int a = 13;
	//  把13的第五位改成1
	a = a | 1 << 4;
	printf("%d\n", a);
	//a = a& (~(1 << 4));
	//printf("%d\n", a);
	a = a ^ 1 << 4;
	printf("%d\n", a);
	return 0;
}


//int main()
//{
//	short s = 5;                     
//	int a = 10;
//	printf("%d ", sizeof(s = a + 2));//short是两个字节
//	printf("%d", s);
//	return 0;
//}


//       ~二进制按位取反

//int main()
//{
//	int a = -1;
//    //  10000000000000000000000000000001  原码
//	//  11111111111111111111111111111110  反码
//	//  11111111111111111111111111111111  补码
//	int b = ~a;
//	printf("%d\n", a);
//	printf("%d\n", b);
//	return 0;
//}
